Practica4/resultados/haproxy_ab.txt
This is ApacheBench, Version 2.3 <$Revision: 1604373 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.56.104 (be patient).....done


Server Software:        Apache/2.2.22
Server Hostname:        192.168.56.104
Server Port:            80

Document Path:          /script.php
Document Length:        23 bytes

Concurrency Level:      5
Time taken for tests:   45.215 seconds
Complete requests:      100
Failed requests:        9
   (Connect: 0, Receive: 0, Length: 9, Exceptions: 0)
Total transferred:      23590 bytes
HTML transferred:       2290 bytes
Requests per second:    2.21 [#/sec] (mean)
Time per request:       2260.752 [ms] (mean)
Time per request:       452.150 [ms] (mean, across all concurrent requests)
Transfer rate:          0.51 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   0.8      1       6
Processing:   623 2233 1363.8   2690    6787
Waiting:      623 2232 1363.6   2689    6787
Total:        624 2234 1364.1   2691    6790

Percentage of the requests served within a certain time (ms)
  50%   2691
  66%   2724
  75%   2768
  80%   2791
  90%   2993
  95%   5468
  98%   6600
  99%   6790
 100%   6790 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1604373 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.56.104 (be patient).....done


Server Software:        Apache/2.2.22
Server Hostname:        192.168.56.104
Server Port:            80

Document Path:          /script.php
Document Length:        23 bytes

Concurrency Level:      5
Time taken for tests:   45.828 seconds
Complete requests:      100
Failed requests:        10
   (Connect: 0, Receive: 0, Length: 10, Exceptions: 0)
Total transferred:      23589 bytes
HTML transferred:       2289 bytes
Requests per second:    2.18 [#/sec] (mean)
Time per request:       2291.408 [ms] (mean)
Time per request:       458.282 [ms] (mean, across all concurrent requests)
Transfer rate:          0.50 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    2   2.3      1      23
Processing:   623 2272 1488.1   2682    7799
Waiting:      623 2271 1487.9   2682    7799
Total:        624 2273 1488.0   2683    7801

Percentage of the requests served within a certain time (ms)
  50%   2683
  66%   2724
  75%   2766
  80%   2825
  90%   2952
  95%   5918
  98%   7796
  99%   7801
 100%   7801 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1604373 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.56.104 (be patient).....done


Server Software:        Apache/2.2.22
Server Hostname:        192.168.56.104
Server Port:            80

Document Path:          /script.php
Document Length:        22 bytes

Concurrency Level:      5
Time taken for tests:   45.097 seconds
Complete requests:      100
Failed requests:        89
   (Connect: 0, Receive: 0, Length: 89, Exceptions: 0)
Total transferred:      23586 bytes
HTML transferred:       2286 bytes
Requests per second:    2.22 [#/sec] (mean)
Time per request:       2254.847 [ms] (mean)
Time per request:       450.969 [ms] (mean, across all concurrent requests)
Transfer rate:          0.51 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        1    1   0.5      1       3
Processing:   623 2229 1441.9   2660    7251
Waiting:      623 2229 1441.7   2660    7251
Total:        624 2231 1442.0   2660    7253

Percentage of the requests served within a certain time (ms)
  50%   2660
  66%   2716
  75%   2733
  80%   2756
  90%   2795
  95%   5769
  98%   7230
  99%   7253
 100%   7253 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1604373 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.56.104 (be patient).....done


Server Software:        Apache/2.2.22
Server Hostname:        192.168.56.104
Server Port:            80

Document Path:          /script.php
Document Length:        22 bytes

Concurrency Level:      5
Time taken for tests:   44.879 seconds
Complete requests:      100
Failed requests:        86
   (Connect: 0, Receive: 0, Length: 86, Exceptions: 0)
Total transferred:      23586 bytes
HTML transferred:       2286 bytes
Requests per second:    2.23 [#/sec] (mean)
Time per request:       2243.962 [ms] (mean)
Time per request:       448.792 [ms] (mean, across all concurrent requests)
Transfer rate:          0.51 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   0.7      1       4
Processing:   614 2222 1382.5   2692    7041
Waiting:      614 2222 1382.5   2692    7041
Total:        616 2224 1382.8   2694    7044

Percentage of the requests served within a certain time (ms)
  50%   2694
  66%   2739
  75%   2766
  80%   2771
  90%   2864
  95%   5586
  98%   6977
  99%   7044
 100%   7044 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1604373 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.56.104 (be patient).....done


Server Software:        Apache/2.2.22
Server Hostname:        192.168.56.104
Server Port:            80

Document Path:          /script.php
Document Length:        23 bytes

Concurrency Level:      5
Time taken for tests:   44.984 seconds
Complete requests:      100
Failed requests:        13
   (Connect: 0, Receive: 0, Length: 13, Exceptions: 0)
Total transferred:      23585 bytes
HTML transferred:       2285 bytes
Requests per second:    2.22 [#/sec] (mean)
Time per request:       2249.217 [ms] (mean)
Time per request:       449.843 [ms] (mean, across all concurrent requests)
Transfer rate:          0.51 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        1    1   0.7      1       4
Processing:   614 2224 1450.0   2662    7238
Waiting:      614 2223 1449.9   2661    7238
Total:        615 2225 1450.0   2663    7239

Percentage of the requests served within a certain time (ms)
  50%   2663
  66%   2704
  75%   2715
  80%   2722
  90%   2763
  95%   6216
  98%   7229
  99%   7239
 100%   7239 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1604373 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.56.104 (be patient).....done


Server Software:        Apache/2.2.22
Server Hostname:        192.168.56.104
Server Port:            80

Document Path:          /script.php
Document Length:        23 bytes

Concurrency Level:      5
Time taken for tests:   46.515 seconds
Complete requests:      100
Failed requests:        5
   (Connect: 0, Receive: 0, Length: 5, Exceptions: 0)
Total transferred:      23594 bytes
HTML transferred:       2294 bytes
Requests per second:    2.15 [#/sec] (mean)
Time per request:       2325.729 [ms] (mean)
Time per request:       465.146 [ms] (mean, across all concurrent requests)
Transfer rate:          0.50 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    2   1.3      1       6
Processing:   627 2303 1438.0   2769    7428
Waiting:      627 2302 1437.9   2769    7428
Total:        627 2305 1438.5   2770    7433

Percentage of the requests served within a certain time (ms)
  50%   2770
  66%   2815
  75%   2850
  80%   2906
  90%   2971
  95%   5706
  98%   7364
  99%   7433
 100%   7433 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1604373 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.56.104 (be patient).....done


Server Software:        Apache/2.2.22
Server Hostname:        192.168.56.104
Server Port:            80

Document Path:          /script.php
Document Length:        23 bytes

Concurrency Level:      5
Time taken for tests:   45.814 seconds
Complete requests:      100
Failed requests:        6
   (Connect: 0, Receive: 0, Length: 6, Exceptions: 0)
Total transferred:      23594 bytes
HTML transferred:       2294 bytes
Requests per second:    2.18 [#/sec] (mean)
Time per request:       2290.712 [ms] (mean)
Time per request:       458.142 [ms] (mean, across all concurrent requests)
Transfer rate:          0.50 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   0.5      1       3
Processing:   623 2264 1352.3   2684    6521
Waiting:      623 2263 1352.1   2683    6521
Total:        624 2265 1352.4   2685    6522

Percentage of the requests served within a certain time (ms)
  50%   2685
  66%   2722
  75%   2777
  80%   2853
  90%   3132
  95%   5474
  98%   6500
  99%   6522
 100%   6522 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1604373 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.56.104 (be patient).....done


Server Software:        Apache/2.2.22
Server Hostname:        192.168.56.104
Server Port:            80

Document Path:          /script.php
Document Length:        23 bytes

Concurrency Level:      5
Time taken for tests:   45.406 seconds
Complete requests:      100
Failed requests:        12
   (Connect: 0, Receive: 0, Length: 12, Exceptions: 0)
Total transferred:      23588 bytes
HTML transferred:       2288 bytes
Requests per second:    2.20 [#/sec] (mean)
Time per request:       2270.295 [ms] (mean)
Time per request:       454.059 [ms] (mean, across all concurrent requests)
Transfer rate:          0.51 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   0.5      1       3
Processing:   619 2242 1431.3   2684    7377
Waiting:      619 2241 1431.2   2683    7377
Total:        620 2243 1431.4   2686    7379

Percentage of the requests served within a certain time (ms)
  50%   2686
  66%   2723
  75%   2744
  80%   2756
  90%   2806
  95%   6322
  98%   7359
  99%   7379
 100%   7379 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1604373 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.56.104 (be patient).....done


Server Software:        Apache/2.2.22
Server Hostname:        192.168.56.104
Server Port:            80

Document Path:          /script.php
Document Length:        23 bytes

Concurrency Level:      5
Time taken for tests:   44.719 seconds
Complete requests:      100
Failed requests:        9
   (Connect: 0, Receive: 0, Length: 9, Exceptions: 0)
Total transferred:      23591 bytes
HTML transferred:       2291 bytes
Requests per second:    2.24 [#/sec] (mean)
Time per request:       2235.963 [ms] (mean)
Time per request:       447.193 [ms] (mean, across all concurrent requests)
Transfer rate:          0.52 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   0.6      1       3
Processing:   615 2210 1371.1   2670    6875
Waiting:      615 2210 1371.0   2670    6875
Total:        617 2211 1371.4   2670    6878

Percentage of the requests served within a certain time (ms)
  50%   2670
  66%   2713
  75%   2729
  80%   2743
  90%   2774
  95%   5408
  98%   6842
  99%   6878
 100%   6878 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1604373 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.56.104 (be patient).....done


Server Software:        Apache/2.2.22
Server Hostname:        192.168.56.104
Server Port:            80

Document Path:          /script.php
Document Length:        23 bytes

Concurrency Level:      5
Time taken for tests:   44.835 seconds
Complete requests:      100
Failed requests:        6
   (Connect: 0, Receive: 0, Length: 6, Exceptions: 0)
Total transferred:      23594 bytes
HTML transferred:       2294 bytes
Requests per second:    2.23 [#/sec] (mean)
Time per request:       2241.726 [ms] (mean)
Time per request:       448.345 [ms] (mean, across all concurrent requests)
Transfer rate:          0.51 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   0.6      1       3
Processing:   625 2221 1432.0   2675    7401
Waiting:      625 2220 1431.9   2675    7400
Total:        627 2222 1432.1   2678    7402

Percentage of the requests served within a certain time (ms)
  50%   2678
  66%   2713
  75%   2748
  80%   2756
  90%   2797
  95%   5863
  98%   7354
  99%   7402
 100%   7402 (longest request)